---
type: ContinuousRail
namespace: Autodesk.Revit.DB.Architecture
version: 2024
members: 7
tags: [revit-api, class]
---

# ContinuousRail

`Autodesk.Revit.DB.Architecture.ContinuousRail` · Revit 2024 · 7 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | GetEndExtensionPath | 2013 | `public IList < Curve > GetEndExtensionPath ()` |
| Method | GetPath | 2013 | `public IList < Curve > GetPath ()` |
| Method | GetStartExtensionPath | 2013 | `public IList < Curve > GetStartExtensionPath ()` |
| Method | GetSupports | 2013 | `public IList < ElementId > GetSupports ()` |
| Property | HostRailingId | 2013 | `public ElementId HostRailingId { get ; }` |
| Property | Length | 2013 | `public double Length { get ; }` |
| Property | Parameter | — | `` |